[
  null,
  "The essential oil (2.5 to 5% in the dried fruits) is dominated by thymol (2-isopropyl-5-methylphenol, 35 to 60%); furthermore, α-pinene, p-cymene, limonene and γ-terpinene have been found.           Ajwain umbel   In the essential oil distilled from aerial parts (flowers, leaves) of ajwain grown in Algeria, how­ever, iso­thymol (50%) was found to be the dominant con­stituent before p-cymene, thymol, limonene and γ-terpinene. Note, however, that the name iso­thymol is not well defined and might refer to both 2-isopropyl-4-methyl­phenol and  3-isopropyl-6-methyl­phenol (carvacrol). (Journal of Essential Oil Research, 15, 39, 2003)  From South Indian ajwain fruits, almost pure thymol has been isolated (98%), but the leaf oil was found to be composed of monoterpenoids and sesquiterpenoids: 43% cadinene, 11% longifolene, 5% thymol, 3% camphor and others. (Indian Journal of Pharmaceutical Sciences, 64, 250, 2002)",
  "Eastern Mediterranean, maybe Egypt  The main cultivation areas today are Persia and India, but the spice is of little importance in global trade.  There is speculation whether a plant mentioned in the Capitulare de villis (see lovage) of Charlemagne might be ajwain; I think this is quite improbable, although I found out by experiment that ajwain can be grown in Central European climate.           Three similar and often confused spices: Fruits of ajwain (upper left), radhuni (upper right) and celery (lower half). 600 dpi scan. ",
  "English ajwain or ajwan is just the ro­man­ized spelling of the Hindi name ajvan [अजवायन, अजवान]. Most Eu­ro­pean lan­guages have similar names, although the spelling is some­times varied, e. g., in Dutch ajowan or German Adiowan. The Hindi name can be traced back to Sanskrit yavanaka [यवनक] or yavani [यवानी], which is derived from the adjective yavana [यवन] Greek. Modern Northern and Southern Indian names like Nepali javano [जवानो], Gujarati yavano [યવણો], Bengali jowan [জোয়ান], Punjabi aijavain [ਐਜਵਾਇਨ] and Tamil omam [ஓமம்] have the same source. This suggests that the spice originated from the Eastern Mediterranean and arrived in India in the course of the Greek conquest of Central Asia.  The Sanskrit term yavana for Greece belongs to the same kin as Arabic al-Yunan [اليونان], Tajiki Yunon [Юнон], Armenian Hounastan [Հունաստան], Azeri Yunanıstan and Hebrew yavan [יוון], which all derive from the name of a Greek tribe, the Ionians (classical name Iones [Ἱώες] contracted from Iaones [Ἱάονες], archaic Iavones [Ἱάϝονες]).  Another group of names for ajwain is derived from Sanskrit ajamoda [अजमोद] or ajamodika [अजमोदिका]. Examples in modern Indian languages include Kannada ajamoda [ಅಜಮೋದ] and Sinhala asamodagam [අසමෝදගම්]. However, very similar or even identical names are often used for another, related Indian spice (Trachyspermum/Carum roxburghianum), which is known in Bengal cuisine as radhuni [রাধুনি] (see also nigella).  Radhuni is often confounded with celery, and the latter takes the name of the former in some Indian languages because the two plants have very similar flavour. Note also that celery and parsley are not much discriminated in India; so Hindi and Urdu ajmud [अजमूद, اجمود] may mean both parsley and celery. To make things worse, the fruits (seeds) of all these plants look very similar, giving rise to further complications.  That Indian name was also transferred to Ethiopia as azmud [አዝሙድ], which is, however, used to designate two different plants: Ajwain is termed netch azmud [ነጭ አዝሙድ] white azmud, whereas tiqur azmud [ጥቁር አዝሙድ] black azmud means nigella.          Ajwain flowers   Some European and Western Asian lan­guages relate ajwain to Egypt: Turkish mısır anason Egyptian anise or Finnish koptilainen kumina Coptic caraway. Indeed, there is ajwain culti­vation in Egypt, but it is not certain whether ajwain was originally native to Egypt. Note the seem­ingly similar Slovak name egyptská čierna rasca Egyptian black caraway which, however, does not refer to ajwain but to nigella.  I cannot explain the Arabic name al-kamun al-muluki [الكمون الملوكي] cumin of the king. Yet there is an interesting parallel in the materia medica of Dioskurides: The description of a herb ammios [ἄμμιος] comes very close to ajwain, and Dioskurides remarks that the plant is also known as Ethiopian or Royal cumin. Old German pharmaceutical catalogues often name ajwain as Königskümmel king’s caraway which is probably derived from either of these two sources. Quite typically for older German herbal literature, there is confusion between cumin and caraway.  Note that the term royal cumin (or imperial cumin) may also be used for a rare Indian spice which I prefer to call black cumin.  The motivation behind the English name bishop’s weed is not clear to me. In any case, this name should best be avoided as it is also used for other plants of the Apiaceae family, e. g., Aegopodium podagraria (also known as ground elder or goutweed) and Ammi visnaga, which is more often known as toothpickweed or by its Arabic name, khella [خلة]."
]